### Exercise 137: Concatenating and Finding the Mean with Null Values for Our testscore Data

In [3]:
import numpy as np
import pandas as pd

In [5]:
# Create dictionary of test scores
test_dict = {'Corey':[63,75,88], 'Kevin':[48,98,92], 'Akshay': [87, 86, 85]}
# Create DataFrame
df = pd.DataFrame(test_dict)

In [7]:
df = df.T
df

         0   1   2
Corey   63  75  88
Kevin   48  98  92
Akshay  87  86  85

In [9]:
df.columns = ['Quiz_1', 'Quiz_2', 'Quiz_3']
df

        Quiz_1  Quiz_2  Quiz_3
Corey       63      75      88
Kevin       48      98      92
Akshay      87      86      85

In [11]:
df['Quiz_4'] = [92, 95, 88]
df

        Quiz_1  Quiz_2  Quiz_3  Quiz_4
Corey       63      75      88      92
Kevin       48      98      92      95
Akshay      87      86      85      88

In [13]:
# Create new DataFrame of one row
df_new = pd.DataFrame({'Quiz_1':[np.NaN], 'Quiz_2':[np.NaN], 'Quiz_3': [np.NaN], 'Quiz_4':[71]}, index=['Adrian'])

In [15]:
# Concatenate DataFrames
df = pd.concat([df, df_new])
df

        Quiz_1  Quiz_2  Quiz_3  Quiz_4
Corey     63.0    75.0    88.0      92
Kevin     48.0    98.0    92.0      95
Akshay    87.0    86.0    85.0      88
Adrian     NaN     NaN     NaN      71

In [17]:
df['Quiz_Avg'] = df.mean(axis=1, skipna=True)
df

        Quiz_1  Quiz_2  Quiz_3  Quiz_4  Quiz_Avg
Corey     63.0    75.0    88.0      92     79.50
Kevin     48.0    98.0    92.0      95     83.25
Akshay    87.0    86.0    85.0      88     86.50
Adrian     NaN     NaN     NaN      71     71.00

In [21]:
df.Quiz_4.astype(float)

Corey     92.0
Kevin     95.0
Akshay    88.0
Adrian    71.0
Name: Quiz_4, dtype: float64

In [23]:
# Create new DataFrame of one row
df_new = pd.DataFrame({'Quiz_1':[np.NaN], 'Quiz_2':[np.NaN], 'Quiz_3': [np.NaN], 'Quiz_4':[71.5]}, index=['Figgy'])

In [25]:
df = pd.concat([df, df_new])
df

        Quiz_1  Quiz_2  Quiz_3  Quiz_4  Quiz_Avg
Corey     63.0    75.0    88.0    92.0     79.50
Kevin     48.0    98.0    92.0    95.0     83.25
Akshay    87.0    86.0    85.0    88.0     86.50
Adrian     NaN     NaN     NaN    71.0     71.00
Figgy      NaN     NaN     NaN    71.5       NaN